Revit 2027 API
SpecTypeId.Energy Property
 Energy, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Energy { get; }
Public Shared ReadOnly Property Energy As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Energy {
	ForgeTypeId^ get ();
}
static member Energy : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace